{
  "name" : "Street",
  "long_description" : "You find yourself on a jagged sideway lined with cigarette butts and the occasional spit wad. Vehicles in all shapes from luxury tanks to duct tape disasters zip past, hovering at rates far exceeding those posted on any rational speedometer. Traffic lights offer multicolor suggestions, but few motorists seem to notice. At some point in the distant past, before the feds abandoned all hope of traffic law enforcement, a lines of steel guard rails were thrown up as a Hail Mary effort to keep oncoming traffic away from sweet old grannies shuffling their way to the neighborhood bodega. Breaches of this barrier are marked by twisted metal and a reddish tint to the accompanying sidewalk. A faint smell of hot dogs and hot dog farts permeates the smoggy air. This \"No Skateboarding\" sign is standing there a few feet away, just glaring at you and really pissing you off.",
  "short_description" : "This busy street has some nice guardrails, but unfortunately, somebody put up a \"No Skateboarding\" sign! Jerks.",
  "visited" : false,
  "virtual_space" : false,
  "object_dictionary" : "./objects/street/",
  "room_features" : [
      {
        "name" : "\"No Skateboarding\" sign",
        "description" : "The sign states very clearly that skateboarding is prohibited in this area. Fine: $300"
      },
      {
        "name" : "Guardrails",
        "description" : "These guardrails look perfect for grinding on with a skateboard!"
      },
      {
        "name" : "Traffic Lights",
        "description" : "There's a panel you could jack into and hack if you just knew how."
      }
  ],
  "room_connections" : [
    {
      "label": "Arcade",
      "cardinal_direction": "North",
      "description": "an exciting sign for an Arcade",
      "destination": "Arcade"
    },
    {
      "label": "Subway",
      "cardinal_direction": "South",
      "description": "the door to the alley leading to the Subway station",
      "destination": "Subway"
    },
    {
      "label": "Hall",
      "cardinal_direction": "East",
      "description": "the main hall of Central High",
      "destination": "Hall"
    },
    {
      "label": "Pawn Shop",
      "cardinal_direction": "West",
      "description": "a great place to buy and sell goods",
      "destination": "Pawn Shop"
    }
  ]
}