{
  "name" : "Hall",
  "long_description" : "Your eyes kind of blank out for a second as you stare down a long corridor of walls inlaid with metal lockers painted purple to compliment the light lavender cinderblock walls. The ceiling is tricked out with evenly spaced emergency sprinklers, there to protect the bastions of our nation's future should any of them catch fire, which just might be possible as there is a teacher surreptitiously smoking in a corner. Your locker, assigned at random, sports 3 marvelous examples of prose, \"Byte Me\", \"Heaven is for Hackers- Always Save\", and \"Nukem\". On the opposite wall in a red and white fire alarm. There's a good chance a hall monitor could catch you skipping. Better move fast.",
  "short_description" : "A corridor of lockers, complete with fire eliminating equipment and a teacher who slept through D.A.RE.",
  "visited" : false,
  "virtual_space" : false,
  "room_features" : [
      {
        "name" : "Locker",
        "description" : "Inside are some of your most prized possessions- naturally security is so high only a hacker could pick this lock.",
        "hackable": false
      },
      {
        "name" : "Teacher",
        "description" : "I guess, maybe just some rando wandered in from the street? Do street randos shop at the Profresh Prof's Discount Suits? They should teach this in school.",
        "hackable": false
      },
      {
        "name" : "Fire Alarm",
        "description" : "This could make an excellent diversion...",
        "hackable": true,
        "description_hacked" : "Just a bunch of mangled wires now."
      }
  ],
  "room_connections" : [
    {
      "label": "Pool on the Roof",
      "cardinal_direction": "North",
      "description": "a door leading to the Pool on the Roof",
      "destination": "Pool on the Roof"
    },
    {
      "label": "School Office",
      "cardinal_direction": "South",
      "description": "a door leading into the Principal's Office",
      "destination": "School Office"
    },
    {
      "label": "Street",
      "cardinal_direction": "West",
      "description": "the door heading outside to the Street",
      "destination": "Street"
    }
  ]
}